andrevcn/MCU_RX100/usb_src/__temp/iodefine.h
struct st_iwdt {
    unsigned char  IWDTRR;
    char           wk0[1];
    union {
        unsigned short WORD;
        struct {
            unsigned short :2;
            unsigned short RPSS:2;
            unsigned short :2;
            unsigned short RPES:2;
            unsigned short CKS:4;
            unsigned short :2;
            unsigned short TOPS:2;
        } BIT;
    } IWDTCR;
    union {
        unsigned short WORD;
        struct {
            unsigned short REFEF:1;
            unsigned short UNDFF:1;
            unsigned short CNTVAL:14;
        } BIT;
    } IWDTSR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char RSTIRQS:1;
        } BIT;
    } IWDTRCR;
    char           wk1[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char SLCSTP:1;
        } BIT;
    } IWDTCSTPR;
};

struct st_mpc {
    union {
        unsigned char BYTE;
        struct {
            unsigned char B0WI:1;
            unsigned char PFSWE:1;
        } BIT;
    } PWPR;
    char           wk0[35];
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P03PFS;
    char           wk1[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P05PFS;
    char           wk2[6];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } P14PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } P15PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } P16PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } P17PFS;
    char           wk3[6];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } P26PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } P27PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } P30PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } P31PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } P32PFS;
    char           wk4[2];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
        } BIT;
    } P35PFS;
    char           wk5[2];
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P40PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P41PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P42PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P43PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P44PFS;
    char           wk6[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } P46PFS;
    char           wk7[5];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } P54PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } P55PFS;
    char           wk8[34];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } PA0PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } PA1PFS;
    char           wk9[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PA3PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PA4PFS;
    char           wk10[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PA6PFS;
    char           wk11[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PB0PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PB1PFS;
    char           wk12[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } PB3PFS;
    char           wk13[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } PB5PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } PB6PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } PB7PFS;
    char           wk14[2];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } PC2PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } PC3PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PC4PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } PC5PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } PC6PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char PSEL:5;
        } BIT;
    } PC7PFS;
    char           wk15[8];
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PE0PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PE1PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PE2PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PE3PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PE4PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PE5PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PE6PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
            unsigned char ISEL:1;
            unsigned char :1;
            unsigned char PSEL:5;
        } BIT;
    } PE7PFS;
    char           wk16[30];
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } PJ6PFS;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ASEL:1;
        } BIT;
    } PJ7PFS;
};

