andrevcn/MCU_RX100/usb_src/__temp/iodefine.h
struct st_smci {
    union {
        unsigned char BYTE;
        struct {
            unsigned char GM:1;
            unsigned char BLK:1;
            unsigned char PE:1;
            unsigned char PM:1;
            unsigned char BCP:2;
            unsigned char CKS:2;
        } BIT;
    } SMR;
    unsigned char  BRR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char TIE:1;
            unsigned char RIE:1;
            unsigned char TE:1;
            unsigned char RE:1;
            unsigned char MPIE:1;
            unsigned char TEIE:1;
            unsigned char CKE:2;
        } BIT;
    } SCR;
    unsigned char  TDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char ORER:1;
            unsigned char ERS:1;
            unsigned char PER:1;
            unsigned char TEND:1;
            unsigned char MPB:1;
            unsigned char MPBT:1;
        } BIT;
    } SSR;
    unsigned char  RDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char BCP2:1;
            unsigned char :3;
            unsigned char SDIR:1;
            unsigned char SINV:1;
            unsigned char :1;
            unsigned char SMIF:1;
        } BIT;
    } SCMR;
};

struct st_system {
    union {
        unsigned short WORD;
        struct {
            unsigned short :15;
            unsigned short MD:1;
        } BIT;
    } MDMONR;
    char           wk0[6];
    union {
        unsigned short WORD;
        struct {
            unsigned short :15;
            unsigned short RAME:1;
        } BIT;
    } SYSCR1;
    char           wk1[2];
    union {
        unsigned short WORD;
        struct {
            unsigned short SSBY:1;
        } BIT;
    } SBYCR;
    char           wk2[2];
    union {
        unsigned long LONG;
        struct {
            unsigned long :3;
            unsigned long MSTPA28:1;
            unsigned long :8;
            unsigned long MSTPA19:1;
            unsigned long :1;
            unsigned long MSTPA17:1;
            unsigned long :1;
            unsigned long MSTPA15:1;
            unsigned long :5;
            unsigned long MSTPA9:1;
        } BIT;
    } MSTPCRA;
    union {
        unsigned long LONG;
        struct {
            unsigned long :1;
            unsigned long MSTPB30:1;
            unsigned long :3;
            unsigned long MSTPB26:1;
            unsigned long :2;
            unsigned long MSTPB23:1;
            unsigned long :1;
            unsigned long MSTPB21:1;
            unsigned long :1;
            unsigned long MSTPB19:1;
            unsigned long :1;
            unsigned long MSTPB17:1;
            unsigned long :7;
            unsigned long MSTPB9:1;
            unsigned long :2;
            unsigned long MSTPB6:1;
            unsigned long :1;
            unsigned long MSTPB4:1;
        } BIT;
    } MSTPCRB;
    union {
        unsigned long LONG;
        struct {
            unsigned long DSLPE:1;
            unsigned long :11;
            unsigned long MSTPC19:1;
            unsigned long :18;
            unsigned long MSTPC0:1;
        } BIT;
    } MSTPCRC;
    char           wk3[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long FCK:4;
            unsigned long ICK:4;
            unsigned long :12;
            unsigned long PCKB:4;
            unsigned long :4;
            unsigned long PCKD:4;
        } BIT;
    } SCKCR;
    char           wk4[2];
    union {
        unsigned short WORD;
        struct {
            unsigned short :5;
            unsigned short CKSEL:3;
        } BIT;
    } SCKCR3;
    union {
        unsigned short WORD;
        struct {
            unsigned short :2;
            unsigned short STC:6;
            unsigned short :6;
            unsigned short PLIDIV:2;
        } BIT;
    } PLLCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char PLLEN:1;
        } BIT;
    } PLLCR2;
    char           wk5[7];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char MOSTP:1;
        } BIT;
    } MOSCCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char SOSTP:1;
        } BIT;
    } SOSCCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char LCSTP:1;
        } BIT;
    } LOCOCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char ILCSTP:1;
        } BIT;
    } ILOCOCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char HCSTP:1;
        } BIT;
    } HOCOCR;
    char           wk6[5];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char HCOVF:1;
            unsigned char PLOVF:1;
            unsigned char :1;
            unsigned char MOOVF:1;
        } BIT;
    } OSCOVFSR;
    char           wk7[1];
    union {
        unsigned short WORD;
        struct {
            unsigned short CKOSTP:1;
            unsigned short CKODIV:3;
            unsigned short :1;
            unsigned short CKOSEL:3;
        } BIT;
    } CKOCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char OSTDE:1;
            unsigned char :6;
            unsigned char OSTDIE:1;
        } BIT;
    } OSTDCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char OSTDF:1;
        } BIT;
    } OSTDSR;
    char           wk8[94];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char OPCMTSF:1;
            unsigned char :1;
            unsigned char OPCM:3;
        } BIT;
    } OPCCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char RSTCKEN:1;
            unsigned char :4;
            unsigned char RSTCKSEL:3;
        } BIT;
    } RSTCKCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char MSTS:5;
        } BIT;
    } MOSCWTCR;
    char           wk9[2];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char HSTS:5;
        } BIT;
    } HOCOWTCR;
    char           wk10[4];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char SOPCMTSF:1;
            unsigned char :3;
            unsigned char SOPCM:1;
        } BIT;
    } SOPCCR;
    char           wk11[21];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :5;
            unsigned char SWRF:1;
            unsigned char :1;
            unsigned char IWDTRF:1;
        } BIT;
    } RSTSR2;
    char           wk12[1];
    unsigned short SWRR;
    char           wk13[28];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :5;
            unsigned char LVD1IRQSEL:1;
            unsigned char LVD1IDTSEL:2;
        } BIT;
    } LVD1CR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char LVD1MON:1;
            unsigned char LVD1DET:1;
        } BIT;
    } LVD1SR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :5;
            unsigned char LVD2IRQSEL:1;
            unsigned char LVD2IDTSEL:2;
        } BIT;
    } LVD2CR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char LVD2MON:1;
            unsigned char LVD2DET:1;
        } BIT;
    } LVD2SR;
    char           wk14[794];
    union {
        unsigned short WORD;
        struct {
            unsigned short PRKEY:8;
            unsigned short :4;
            unsigned short PRC3:1;
            unsigned short PRC2:1;
            unsigned short PRC1:1;
            unsigned short PRC0:1;
        } BIT;
    } PRCR;
    char           wk15[48784];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char LVD2RF:1;
            unsigned char LVD1RF:1;
            unsigned char :1;
            unsigned char PORF:1;
        } BIT;
    } RSTSR0;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char CWSF:1;
        } BIT;
    } RSTSR1;
    char           wk16[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char MOSEL:1;
            unsigned char MODRV21:1;
        } BIT;
    } MOFCR;
    char           wk17[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char LVD2E:1;
            unsigned char LVD1E:1;
            unsigned char :1;
            unsigned char EXVCCINP2:1;
        } BIT;
    } LVCMPCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char LVD2LVL:2;
            unsigned char LVD1LVL:4;
        } BIT;
    } LVDLVLR;
    char           wk18[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char LVD1RN:1;
            unsigned char LVD1RI:1;
            unsigned char :3;
            unsigned char LVD1CMPE:1;
            unsigned char :1;
            unsigned char LVD1RIE:1;
        } BIT;
    } LVD1CR0;
    union {
        unsigned char BYTE;
        struct {
            unsigned char LVD2RN:1;
            unsigned char LVD2RI:1;
            unsigned char :3;
            unsigned char LVD2CMPE:1;
            unsigned char :1;
            unsigned char LVD2RIE:1;
        } BIT;
    } LVD2CR0;
};

